;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! arduino-mode)
(package! autothemer)
(package! catppuccin-theme)
(package! command-log-mode
  :recipe
  (:host github
   :repo "lewang/command-log-mode"))
(package! dashboard)
(package! dired-single)
(package! elcord)
(package! org-alert)
(package! page-break-lines)
(package! structurizr
  :recipe
  (:host github
   :repo "gilesp/structurizr-mode"))
(package! systemd-mode)
(package! timu-caribbean-theme)
(package! timu-macos-theme)
(package! wakatime-mode)
